Revit 2022 API
AnalyticalAlignmentMethod Enumeration
 Specifies how analytical model is being aligned in space
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public enum AnalyticalAlignmentMethod
Visual Basic
Public Enumeration AnalyticalAlignmentMethod
Visual C++
public enum class AnalyticalAlignmentMethod
Members
Member name | Description
AutoDetect |  Auto-detect projections for analytical model.
Projection |  Manually set projections for analytical model using projection parameters.
ManuallyAdjusted |  Reports if analytical model has been manually adjusted, this value can only set internally by Revit.
Varies |  Alignment types are different at each end.
See Also
Autodesk.Revit.DB.Structure Namespace